init_feedback_kinds = [
    {
        "title": "Санал",
        "rank": 10,
    },
    {
        "title": "Хүсэлт",
        "rank": 20
    },
    {
        "title": "Гомдол",
        "rank": 30
    },
    {
        "title": "Үл тохирох",
        "rank": 40
    },
]

init_work_calendar_kinds = [
    {
        "title": "Хувийн ажил",
        "textColor": "#ccc",
    },
    {
        "title": "Ажлын уулзалт",
        "textColor": "#ccc"
    },
    {
        "title": "Гадуурхи ажил",
        "textColor": "#ccc"
    },
    {
        "title": "Амралтын өдөр",
        "textColor": "#ccc"
    },
    {
        "title": "Бичиг баримт хөөцөлдөх",
        "textColor": "#ccc"
    },
]

init_forTomilolt = [
    {
        "name": "Хуралд оролцох",
    },
    {
        "name": "Засвар хийх",
    },
    {
        "name": "Сургалтанд суух",
    },
    {
        "name": "Сургалт зохион байгуулах",
    },
    {
        "name": "Зар суртчилгаа хийх",
    },
]

init_static_shagnal = [
    {
        "name": "МЗХ-ны шагналууд, шагнагдсан он",
        "order": 0,
    },
    {
        "name": "Хөдөлмөрийн хүндэт медаль, шагнагдсан он",
        "order": -1,
    },
    {
        "name": "Ардын хувьсгалын ойн медалиуд, шагнагдсан он",
        "order": -2,
    },
    {
        "name": "Хөдөлмөрийн гавъяаны Улаан тугийн одон, шагнагдсан он",
        "order": -3,
    },
    {
        "name": "Аймгийн шагналууд, шагнагдсан он",
        "order": -4,
    },
    {
        "name": "ЭХС-ийн ойн медалиуд, шагнагдсан он",
        "order": -5,
    },
    {
        "name": "Алтан гадас одон, шагнагдсан он",
        "order": -6,
    },
]

init_shagnal = [
    {
        "name": "Компанийн өргөмжлөл, шагнагдсан он",
        "order": 5,
    },
    {
        "name": "Компанийн мэргэжлийн аварга, шагнагдсан он",
        "order": 4,
    },
    {
        "name": "Компанийн хөдөлмөрийн аварга, шагнагдсан он",
        "order": 3,
    },
    {
        "name": "ЭХЯ-ны Жуух бичиг, шагнагдсан он /бүх салбарын жуух бичиг энд бичигдэнэ/",
        "order": 2,
    },
    {
        "name": "ЭХ-ний Тэргүүнийн ажилтан, шагнагдсан он /бүх салбарын тэргүүний шагналууд энд бичигдэнэ/",
        "order": 1,
    },
]

init_notif_types = [
    {
        "name": "Чухал",
        "color": "#EF0101",
        "level": 90,
        "code": "important",
    },
    {
        "name": "Анхааруулага",
        "color": "#EFAF01",
        "level": 100,
        "code": "warning",
    },
    {
        "name": "Энгийн",
        "color": "#06C10A",
        "level": 10,
        "code": "normal",
    },
]

init_skills = [
    {
        "name": "Хувь хүний ур чадвар",
        "skills": [
            {
                "name": "Өөрийгөө танин мэдэх",
                "defs": [
                    {
                        "name": "Өөрийгөө эрхэмлэн дээдлэх зүйлс ба тэргүүлэх чиглэлээ тодорхойлох",
                    },
                    {
                        "name": "Танин мэдэх хэв маягаа тогтоох",
                    },
                    {
                        "name": "Өөрчлөлтийг хүлээн авах",
                    },
                ]
            },
            {
                "name": "Стрессээ тайлах",
                "defs": [
                    {
                        "name": "Стрессийн хүчин зүйлсийг намжаах",
                    },
                    {
                        "name": "Цагийг зүй зохистой ашиглах",
                    },
                    {
                        "name": "Эрх мэдлээ төлөөлүүлэх",
                    },
                ]
            },
            {
                "name": "Асуудлыг бүтээлчээр шийдвэрлэх",
                "defs": [
                    {
                        "name": "Зүй зохистой хандлагыг хэрэглэх",
                    },
                    {
                        "name": "Бүтээлч хандлагыг ашиглах",
                    },
                    {
                        "name": "Шинэ санаачлагаыг дэмжих",
                    },
                ]
            },
        ]
    },
    {
        "name": "Хүмүүё хоорондын харилцааны ур чадвар",
        "skills": [
            {
                "name": "Бусадтай бие биенийгээ дэмжсэн харилцаа холбоо тогтоох",
                "defs": [
                    {
                        "name": "Халамжлах",
                    },
                    {
                        "name": "Зөвлөгөө өгөх",
                    },
                    {
                        "name": "Бусдыг сонсох",
                    },
                ]
            },
            {
                "name": "Эрх мэдлийнхээ хүрээнд бусдад нөлөөлөх",
                "defs": [
                    {
                        "name": "Эрх мэдлээ хэрэгжүүлэх",
                    },
                    {
                        "name": "Бусдад нөлөөлөх",
                    },
                    {
                        "name": "Бусдад бүрэн эрх олгох",
                    },
                ]
            },
            {
                "name": "Бусдад урам хайрлах",
                "defs": [
                    {
                        "name": "Үр нөлөөгүй үйл ажиллагааг илрүүлэх",
                    },
                    {
                        "name": "Урам зориг оруулах орчин бий болгох",
                    },
                    {
                        "name": "Амжилтыг урамшуулах",
                    },
                ]
            },
            {
                "name": "Зөрчлийг зохицуулах",
                "defs": [
                    {
                        "name": "Шалтгааныг тогтоох",
                    },
                    {
                        "name": "Тохирох стратегийг сонгох",
                    },
                    {
                        "name": "Сөргөлдөрх явдлыг арилгах",
                    },
                ]
            },
        ]
    },
    {
        "name": "Бүлгээр ажиллах ур чадвар",
        "skills": [
            {
                "name": "",
                "defs": [
                    {
                        "name": "Үр нөлөөтэй баг бүрдүүлэх",
                    },
                    {
                        "name": "Бусдын эрх мэдэл, бүрэн эрхийг хүндэтгэж дэмжлэг үзүүлэх",
                    },
                    {
                        "name": "Мэдлэг, мэдээллээ бусадтай хуваалцах",
                    },
                ]
            },
        ]
    },
    {
        "name": "Бусад ур чадвар",
        "skills": [
            {
                "name": "",
                "defs": [
                    {
                        "name": "Үүрэг хүлээх",
                    },
                    {
                        "name": "Хариуцлага хүлээх",
                    },
                    {
                        "name": "Нийтийн зорилгод тууштай байх",
                    },
                    {
                        "name": "Өөрийгөө хөгжүүлэх",
                    },
                    {
                        "name": "Асуудал боловсруулах",
                    },
                    {
                        "name": "Оновчтой шийдвэр гаргах",
                    },
                ]
            },
        ]
    },
]
